import './DocumentModal.css';

interface Props {
  onClose: () => void;
}

const BiographyModal = ({ onClose }: Props) => {
  return (
    <div className="document-modal-overlay" onClick={onClose}>
      <div className="document-modal-content" onClick={(e) => e.stopPropagation()}>
        <div className="document-modal-header">
          <h2>Leader Biography</h2>
          <button className="document-close-btn" onClick={onClose}>&times;</button>
        </div>
        <div className="document-modal-body">
          <h4>தலைவர்  நிறுவனர் திரு S  வினோத்குமார் 6.10.1976. ஆம் ஆண்டு பிறந்தவர் தமிழகத்தை பூர்விகமாக கொண்டு ஆசிரியர் நகர்  என்னும் குக் கிராமத்தில் பிறந்தவர் சிறு வயது முதல் சமூக அக்கறையும் சமூக அவலங்களையும் தட்டிக் கேட்டவர் பல சட்ட போராட்டங்களை நடத்தியவர்  சமூகத்தில் ஏற்படும் பல அநீதிகளை கண்டு பொங்கி எழுந்து  பின்னர் சாதி மதம் மொழி இவை அனைத்தும் கடந்து மக்கள் அரசியல் அரசியல் கட்சி என்ற பெயரில் புதிய கட்சியை தொடங்கினார், பெரியார் அம்பேத்கார் வேலு நாச்சியார் காரல் மார்க்ஸ் தமிழ் தேசியம் இவருக்கு மிகவும் பிடித்துப்போனது சுதந்திரப் போராட்ட தியாகிகளையும் மற்றும்  சமூக நீதி. ஜனநாயகம். மதச்சார்பின்மை. சமதர்மம் .இவை அனைத்திற்கும் போராடிய அனைத்து தலைவர்களையும் மதித்து அவர்கள் வழியிலே கட்சி கொள்கையை வடிவமைத்தார்  சாதி மதம் மொழிகளை தாண்டி புதிய தமிழகத்தை உருவாக்க வேண்டும் என்பதை லட்சியம் கொண்டு செயல்படுபவர்.</h4><br></br>
          <h4>மக்கள் அரசியல் கட்சி ஜாதி மதம் மொழி இவை அனைத்தும் கடந்து 25.1.2019. அன்று கட்சி நிறுவினார் தலைவர் S  வினோத்குமார் அவர்கள் நோக்கம்  சாதி மதம் மொழிகளுக்கு அப்பர் பட்டு  சமூக நீதி .சம தர்மம். மதசார்பின்மை. ஜனநாயகம் .காப்பது. இந்திய இறையாண்மை காப்பது. அனைவருக்கும் அனைத்தும் சமமாக கிடைக்கும் பாடுவது லட்சியமாக கொண்டு செயல்படுகிறது மக்கள் அரசியல்  கட்சி</h4><br></br>
          

        </div>
      </div>
    </div>
  );
};

export default BiographyModal;
